{"listing":
  {"id":36837,"name":"Takoma Wellness Center","slug":"takoma-wellness-center-2-2","state":"District of Columbia","best_of_weedmaps":false,"social_equity":false,"city":"Washington","type":"dispensary","wmid":899792541,"latitude":38.974267,"longitude":-77.017552,"web_url":"https://weedmaps.com/dispensaries/takoma-wellness-center-2-2","package_level":"listing_plus","feature_order":1,"ranking":4.666042400771737,"rating":4.75792349726776,"reviews_count":366,"avatar_image":{"small_url":"https://images.weedmaps.com/dispensaries/000/036/837/avatar/square_fill/1601380061-little_logo.png","original_url":"https://images.weedmaps.com/dispensaries/000/036/837/avatar/original/1601380061-little_logo.png"},"has_sale_items":false,"license_type":"medical","address":"6925 Blair Road NW","distance":null,"zip_code":"20012","timezone":"America/New_York","intro_body":"\u003cp\u003e*Credit Cards Temporarily Unavailable* Washington, DC's Family Owned \u0026 Operated Medical Marijuana Dispensary. Now Accepting Out Of State Medical Cannabis Cardholders From All *Active* States (Not Virginia, Yet)  VOTED BEST IN DC '17, '18 \u0026 '19!  We accept *active* medical marijuana programs including Alaska, Arizona, Arkansas, California, Colorado, Connecticut, Delaware, Florida, Hawaii, Illinois, Maine, Maryland, Massachusetts, Michigan, Montana, Nevada, New Hampshire, New Jersey, New Mexico, New York, North Dakota, Ohio, Oregon, Pennsylvania, Rhode Island, Vermont \u0026 Washington. All patients must have a valid state card/certification and government issued photo ID.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUnfortunately, Virginia patients are not accepted until dispensaries open in Virginia.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eWe are happy to help DC residents with their applications and renewals on Mondays, Tuesdays and Wednesdays. They can also be processed online through the DC Department of Health website.\u003c/p\u003e","support_cause_link":null,"gofundme_link":null,"static_map_url":"https://staticmap.weedmaps.com/static_map/13/38.974267/-77.017552/402/147/map.png","open_now":false,"closes_in":null,"todays_hours_str":"11:00am -  5:00pm","min_age":21,"region_id":355,"menu_items_count":425,"verified_menu_items_count":0,"endorsement_badge_count":0,"is_published":true,"online_ordering":{"is_orders_enabled":false,"is_logistics_enabled":false,"after_hours_enabled":true,"enabled_for_pickup":false,"enabled_for_delivery":false,"identification_required":true,"purchase_min":{"cents":0,"currency":"USD","amount":0.0},"fee":{"cents":0,"currency":"USD","amount":0.0},"eta_min":0,"eta_max":0,"display_eta":false,"wm_service_fee":{"cents":0,"currency":"USD","amount":0.0}},"retailer_services":["storefront","pickup"],"has_curbside_pickup":true,"has_featured_deal":false,"description":"\u003cp\u003eTakoma Wellness Center Takoma Wellness Center is proud to be a family-owned and operated and licensed medical cannabis dispensary in the District of Columbia, one of five total licensed dispensaries in the city. Committed to putting patients before all else, they provide a warm and friendly environment for patients to discover and explore medical cannabis, often hold educational seminars, private sessions, and classes. Takoma Wellness Center works within the community to broaden the medical marijuana program in D.C. by breaking through the stigma with knowledge and proven success.\u003c/p\u003e\u003cp\u003e \u003c/p\u003e\u003cp\u003e\u003cstrong\u003ePlease Note:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eTakoma Wellness Center honors reciprocity, and now can see out of state medical marijuana card holders from all *active* states with a valid government identification and out of state medical marijuana card or appropriate state credentials.\u003c/p\u003e\u003cp\u003e \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eHistory: \u003c/strong\u003e\u003c/p\u003e\u003cp\u003eThe family behind Takoma Wellness know well how cannabis can exponentially improve individuals’ lives: their grandfather had multiple sclerosis, and while prescriptions drugs were riddled with adverse side effects, medical marijuana helped him regain his quality of life. After retiring from their careers and moving Washington D.C., there was an opportunity to open a dispensary in their grandfather’s memory, as a place where patients would feel comfortable. In August 2013, Takoma Wellness began serving their community as one of the first dispensaries in the District of Columbia, today catering to over 1,000 individuals, nearly 25-30% of the patient population.\u003c/p\u003e\u003cp\u003e \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eStaff: \u003c/strong\u003e\u003c/p\u003e\u003cp\u003eTakoma Wellness Center works hard to be a warm and caring environment that focuses on patients first, with a strong emphasis placed on education and relationships. New patients each are guided through a first-time consultation, where an educated member of their team explains medical cannabis, proper dosing, consumption methods and answers any question patients may have. Takoma Wellness Center also closely works with American’s for Safe Access, actively working correct misinformation, remove the negative stigma of medical cannabis, and work in close collaboration with D.C. legislators to expand the MMRP program in the city.\u003c/p\u003e\u003cp\u003e \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eMenu: \u003c/strong\u003e\u003c/p\u003e\u003cp\u003eAs one of the oldest dispensaries in the District of Columbia, Takoma Wellness Center boasts one of the largest selections as well, with over 125 products and more than 60 different strains of flower alone. All medicine originates from one of eight cultivation centers in D.C., with their exclusive strains of Pineapple Express, Hawaiian Trainwreck, Medical Haze and KushZilla all popular with their patients. Takoma Wellness Center is also proud to be the first dispensary in DC to offer Jackson’s Courage (whole plant CBD dominant oil) after one of their patients, and offer this oil free to minors in need. Takoma Wellness Center gladly accepts both debit cards and cash payments and is proud to offer discounts to veterans and patients below the poverty level. They also offer discounts on patient renewals, first-time registration patients, birthdays, and through their loyalty program throughout the year. They encourage patients to follow-up with any questions or concerns, as they know that finding the best medicine for individual needs takes time. Parking is plentiful and handicap accessible.\u003c/p\u003e\u003cp\u003e \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eService Locations:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eNestled in the northwestern quarter of Washington, D.C., Takoma Wellness Center is right across the street from the Takoma Metro Station near the Maryland border. They are proud to serve the neighborhoods of Takoma, Manor Park, Brightwood, Fort Totten Chevy Chase, Forest Hills, Friendship Heights, Tenleytown, Cleveland Park, Spring Valley, Palisades and the greater D.C. area.\u003c/p\u003e\u003cp\u003e \u003c/p\u003e\u003cp\u003e\u003cstrong\u003e Location Information: \u003c/strong\u003e\u003c/p\u003e\u003cp\u003eTakoma is one of the northernmost areas of the District of Columbia, which is itself a cornucopia of national landmarks and tourist attractions. As the United States Capitol, Washington D.C. houses the White House, the United States Capitol and the Library of Congress. It’s also home to a great number of museums, such as Smithsonian National Museum of Natural History, the United States Holocaust Memorial Museum, the Folger Shakespeare Library, the International Spy Museum, and much more. The Washington Monument, National Mall, Thomas Jefferson Memorial and Lincoln Memorial are all tourist draws as well as the United States National Arboretum and Kenilworth Park.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eRewards Program:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eJoin our rewards program for special offers!\u003c/p\u003e\u003cp\u003eThe rewards program is a gift. Points can expire and/or change at any time.\u003c/p\u003e","first_time_announcement":"\u003cp\u003eNEW PATIENTS: 20% DISCOUNT ENTIRE ORDER - NO MINIMUM\u003c/p\u003e\u003cp\u003eMust be redeemed on the first visit.\u003c/p\u003e\u003cp\u003eFree CBD Oil (Jackson's Courage) to minors enrolled in MMJ program!\u003c/p\u003e","announcement":"\u003cp\u003eTakoma Wellness Center now ACCEPTS Virginia, Minnesota, Missouri, Utah and Oklahoma Medical Marijuana card holders! Along with ALL out of state caregivers (with medical cards). Please bring your medical card AND government-issued ID. \u003c/p\u003e","announcement_updated_at":"2020-10-21T22:04:08.198Z","country":"US","phone_number":"(202) 465-4260","email":"info@takomawellness.com","website":"http://takomawellness.com/","has_handicap_access":true,"has_photos":false,"has_videos":false,"accepts_credit_cards":false,"has_testing":false,"is_recreational":false,"has_atm":true,"has_security_guard":true,"is_verified_seller":false,"has_endorsement_badges":false,"has_age_gate":true,"license_number":"MMP00069","licenses":[{"type":"Medical Retail","number":"MMP00069"}],"business_hours":{"sunday":{"open":"11:00am","close":"5:00pm"},"monday":{"open":"11:30am","close":"7:00pm"},"tuesday":{"open":"11:30am","close":"7:00pm"},"wednesday":{"open":"11:30am","close":"7:00pm"},"thursday":{"open":"11:30am","close":"7:00pm"},"friday":{"open":"11:30am","close":"7:00pm"},"saturday":{"open":"11:00am","close":"5:00pm"}},"social":{"facebook_id":"http://www.facebook.com/takomawellness","instagram_id":"http://www.instagram.com/takomawellness","twitter_id":"http://www.twitter.com/takomawellness","youtube_ids":[]},"region":{"id":355,"name":"Washington DC","slug":"washington-dc","region_path":"united-states/washington-dc"},"member_since":"2014","price_aggregations":{"unit":{"units":"1","min":0.75,"max":479.0},"gram":[{"units":"1/2","min":7.75,"max":120.0},{"units":"1","min":8.08,"max":190.0}],"ounce":[{"units":"1/8","min":27.2,"max":70.0},{"units":"1/4","min":54.4,"max":140.0},{"units":"1/2","min":107.1,"max":280.0},{"units":"1","min":211.65,"max":560.0}]},"promo_code":null}
    
    }